vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.S32K3xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.28/schema/PACK.xsd" schemaVersion="1.7.28">
  <vendor>Keil</vendor>
  <name>S32K3xx_DFP</name>
  <description>NXP S32K3xx Device Support</description>
  <url>https://www.keil.com/pack/</url>
  <license>LICENSE</license>

  <releases>
    <release version="1.0.1" date="2024-02-12" deprecated="2024-02-12">
      This Software Pack is no longer maintained.
	  Please contact the device vendor (NXP) for for available Software Development Kits.
    </release>
    <release version="1.0.0" date="2021-10-20">
      Initial version of NXP S32K3xx Device Family Pack
      Please report any debug authentication problems to support.intl@keil.com
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>S32K3xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="S32K Series" Dvendor="NXP:11">

      <subFamily DsubFamily="S32K3xx">

        <description>
          The S32K3 family includes Arm Cortex-M7-based MCUs in single, dual and lockstep core configurations
          supporting ASIL B/D safety applications. Features include a hardware security engine with NXP firmware,
          support for firmware over-the-air (FOTA) updates and free ISO 26262 compliant real-time software
          drivers for AUTOSAR and non-AUTOSAR. S32K3 MCUs are available in NXP’s new MaxQFP package, which
          reduces package footprint by up to 55% compared with standard QFP package.
        </description>

        <sequences>
          <!-- Helper sequences -->
          <sequence name="ResetHardwareDeassert_Default">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;

              // Assert nRESET line and check if nRESET is readable
              canReadPins = (DAP_SWJ_Pins(nReset, nReset, 0) != 0xFFFFFFFF);
            </block>
            <!-- Wait max. 1s for nRESET to recover from reset if readable-->
            <control if="canReadPins" while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>

            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control if="!canReadPins" while="1" timeout="100000"/>
          </sequence>

          <sequence name="EnableM7Debug">
            <block info="Enable M7 cores debugging in SDA_AP">
              __var ap = __ap;                                  // Save current AP

              __ap = 7;                                         // Select SDA_AP
              WriteAP(0x80, 0x300000F0);                        // Enable M7 Debug in SDA_AP.DBGENCTRL
              __ap = ap;                                        // Restore AP
            </block>
          </sequence>

          <sequence name="FunctionalReset">
            <block info="Initiate functional reset">
              __var ap = __ap;                                  // Save current AP

              __ap = 6;                                         // Select MDM_AP
              WriteAP(0x04, 0x00400B00);                        // Assert RSTRELCM7/RSTRELTLn, CMnDBGREQ (MDMAPCTL)
              WriteAP(0x04, 0x00400B20);                        // Assert RSTRELCM7/RSTRELTLn, CMnDBGREQ and SYSFUNCRST (MDMAPCTL)
              WriteAP(0x04, 0x00400B00);                        // Assert RSTRELCM7/RSTRELTLn, CMnDBGREQ (MDMAPCTL)
              WriteAP(0x04, 0x00400000);                        // Assert RSTRELCM7/RSTRELTLn (MDMAPCTL)
              __ap = ap;                                        // Restore AP
            </block>
          </sequence>

          <sequence name="DebugFromFirstInstruction">
            <block>
              __var ap = __ap;                                  // Save current AP
            </block>
            <block>
              Sequence("EnableM7Debug");
            </block>
            <block>
              __ap = 6;                                         // set MDM-AP
              WriteAP(0x04, 0x00430000);                        // MDMAPCTL: Bits 16 and 17 CM7_x_CORE_ACCESS
            </block>
            <block>
              __ap = 7;                                         // SDA_AP;
              WriteAP(0x90, 0x00000000);                        // SDAAPRSTCTRL: Ensure M7_1 and M7_0 are held in reset (RSTRELTLCM71/RSTRELTLCM70 = 0)
            </block>
          </sequence>

          <sequence name="DebugEnablement">
            <block>
              Sequence("EnableM7Debug");                        // Enable M7 debugging
            </block>
            <control if="DoRAMInitialize">
              <block>
                Sequence("EnablePeripheralClocks");             // Enable peripheral clocks
                Sequence("RAMInitialize");                      // Do RAM Initialize
              </block>
            </control>
          </sequence>

          <!-- Default sequence overrides -->
          <sequence name="ResetHardwareDeassert">
            <block>
              __var ap = __ap;                                  // Save current AP
              __var sdaaprstctrl_val;
            </block>

            <control if="ap == 4">
              <block>
                sdaaprstctrl_val = 0x02000000;                  // release CM7_0 from reset (RSTRELTLCM70 = 1)
              </block>
            </control>
            <control if="ap == 5">
              <block>
                sdaaprstctrl_val = 0x04000000;                  // release CM7_1 from reset (RSTRELTLCM71 = 1)
              </block>
            </control>

            <control if="(__connection &amp; 0x00010000)">
              <block>
                __errorcontrol = 1;
                __ap = 7;                                       // __ap = SDA_AP;
                WriteAP(0x90, sdaaprstctrl_val);                // SDAAPRSTCTRL: Release M7_0 or M7_1 from reset
                __ap = ap;
                __errorcontrol = 0;
              </block>
              <block>
//                DAP_Delay(1000000);
                __errorcontrol = 1;
                Sequence("DebugEnablement");                    // Call DebugEnablement
                __errorcontrol = 0;
              </block>
            </control>

            <control if="(__connection &amp; 0x00010000) == 0x00000000" info="connect normal">
              <block>
                Sequence("ResetHardwareDeassert_Default");
              </block>
            </control>
          </sequence>

          <sequence name="DebugDeviceUnlock">
            <control if="(__connection &amp; 0x00010000)"               info="connect under reset">
              <block>
                Sequence("DebugFromFirstInstruction");
                Sequence("ResetHardwareDeassert_Default");
              </block>
            </control>

            <control if="(__connection &amp; 0x00010000) == 0x00000000" info="connect normal">
              <block>
                Sequence("DebugEnablement");                    // Call DebugEnablement
              </block>
            </control>
          </sequence>

          <sequence name="ResetSystem">
            <block>
              Sequence("FunctionalReset");                      // Call FunctionalReset
            </block>
          </sequence>
        </sequences>

