vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.S32K3xx_DFP.pdsc
          <!-- Memory adresses -->
          <memory name="PFlash" access="rx"      start="0x00400000" size="0x00200000" startup="1" default="1"/> <!-- Program Flash -->
          <memory name="DFlash" access="rx"      start="0x10000000" size="0x00020000" startup="0" default="0"/> <!-- Data Flash -->
          <memory name="SRAM_0" access="rwx"     start="0x20400000" size="0x00018000" init   ="0" default="1"/> <!-- 96 SRAM_0 Non-cacheable -->
          <memory name="DTCM_0" access="rwx"     start="0x20000000" size="0x00010000" init   ="0" default="0"/> <!-- 64 DTCM_0 Non-cacheable -->

          <!-- Flash Algorithms -->
          <algorithm name="Flash/S32K3x2_Code.FLM" start="0x00400000" size="0x00200000" RAMstart="0x20400000" RAMsize="0x00010000" default="1"/>
          <algorithm name="Flash/S32K3x2_Data.FLM" start="0x10000000" size="0x00020000" RAMstart="0x20400000" RAMsize="0x00010000" default="0"/>

          <!-- Debug access ports -->
          <debug Pname="Cortex-M7_0" __dp="0" __ap="4"/>
        </device>

        <!-- ******************************  Device 'S32K314'  ****************************** -->
        <device Dname="S32K314">          <!-- 1 x Cortex-M7 Single Core-->
          <processor Pname="Cortex-M7_0" Dcore="Cortex-M7"  DcoreVersion="r1p2" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dclock="160000000"/>
          <compile   Pname="Cortex-M7_0" header="Device/S32K314/Include/S32K314.h" define="CPU_S32K314" Pdefine="S32K3xx_M7_0"/>
          <debug     Pname="Cortex-M7_0" svd="Device/S32K314/Debug/S32K314.svd"/>

          <debugvars configfile="Device/S32K314/Debug/S32K3xx.dbgconf" version="1.0.0">
            __var DoRAMInitialize = 1;                            // Enabled
          </debugvars>

          <sequences>
            <sequence name="EnablePeripheralClocks">
              <block info="Enable peripheral clocks">
                // partition 0
                Write32(0x402DC134,0x0000F7DF);                   // Enable clock for block 1 in partition 0 (MC_ME.PRTN0_COFB1_CLKEN)
                Write32(0x402DC100,0x00000001);                   // Enable clock to IPs (MC_ME.PRTN0_PCONF)
                Write32(0x402DC104,0x00000001);                   // Trigger the hardware process (MC_ME.PRTN0_PUPD)
                Write32(0x402DC000,0x00005AF0);                   // Start the hardware process; key '5AF0' (MC_ME.MC_ME_CTL_KEY
                Write32(0x402DC000,0x0000A50F);                   //                             key 'A50F' (MC_ME.MC_ME_CTL_KEY

                // partition 1
                Write32(0x402DC330,0xB1E0FFF8);                   // Enable clock for block 0 in partition 1 (MC_ME.PRTN1_COFB0_CLKEN)
                Write32(0x402DC334,0x812AA407);                   // Enable clock for block 1 in partition 1 (MC_ME.PRTN1_COFB1_CLKEN)
                Write32(0x402DC338,0xBBF3FE7E);                   // Enable clock for block 2 in partition 1 (MC_ME.PRTN1_COFB2_CLKEN)
                Write32(0x402DC33C,0x00000141);                   // Enable clock for block 3 in partition 1 (MC_ME.PRTN1_COFB3_CLKEN)
                Write32(0x402DC300,0x00000001);                   // Enable clock to IPs (MC_ME.PRTN1_PCONF)
                Write32(0x402DC304,0x00000001);                   // Trigger the hardware process (MC_ME.PRTN1_PUPD)
                Write32(0x402DC000,0x00005AF0);                   // Start the hardware process; key '5AF0' (MC_ME.MC_ME_CTL_KEY
                Write32(0x402DC000,0x0000A50F);                   //                             key 'A50F' (MC_ME.MC_ME_CTL_KEY

                // partition 2
                Write32(0x402DC530,0x29FFFFF0);                   // Enable clock for block 0 in partition 2 (MC_ME.PRTN2_COFB0_CLKEN)
                Write32(0x402DC534,0xC48987F9);                   // Enable clock for block 1 in partition 2 (MC_ME.PRTN2_COFB1_CLKEN)
                Write32(0x402DC500,0x00000001);                   // Enable clock to IPs (MC_ME.PRTN2_PCONF)
                Write32(0x402DC504,0x00000001);                   // Trigger the hardware process (MC_ME.PRTN2_PUPD)
                Write32(0x402DC000,0x00005AF0);                   // Start the hardware process; key '5AF0' (MC_ME.MC_ME_CTL_KEY
                Write32(0x402DC000,0x0000A50F);                   //                             key 'A50F' (MC_ME.MC_ME_CTL_KEY
              </block>
            </sequence>

            <sequence name="RAMInitialize">
              <block>
                __var TCD_B0 = 0x40210000;                        // TCD Base Address; TCD0 = 0x40210000, TCD1 = 0x40214000
                __var CHCFG0 =       0x03;                        // CH0 = 3, CH1 = 2, CH2 = 1, CH3 = 0

                __var TCD_B1 = 0x40214000;                        // TCD Base Address; TCD0 = 0x40210000, TCD1 = 0x40214000
                __var CHCFG1 =       0x02;                        // CH0 = 3, CH1 = 2, CH2 = 1, CH3 = 0
              </block>

              <block info="Initialize SRAM via DMA">
                // SRAM: 2 x 160kB @ 0x20400000
                Write8(0x40280000 + CHCFG0, 0x80);                // Enable DMA CH0 (DMAMUX_0 register CHCFG0)
                Write32(TCD_B0 + 0x020, 0x00400000);              // Source address '0x00400000' (DMA TCD register TCD0_SADDR)
                Write32(TCD_B0 + 0x024, 0x03030000);              // Offset '0' and attributes SSIZE, DSIZE '64bit' (DMA TCD register TCD0_SOFF, TCD0_ATTR)
                Write32(TCD_B0 + 0x028, 0x00050000);              // Transfer size Nbytes '320Kb' (DMA TCD register TCD0_NBYTES_MLOFFNO)
                Write32(TCD_B0 + 0x02C, 0x00000000);              // Last source address adjustment '0' (DMA TCD register TCD0_SLAST_SDA)
                Write32(TCD_B0 + 0x030, 0x20400000);              // Destination address '0x20400000' (DMA TCD register TCD0_DADDR)
                Write32(TCD_B0 + 0x034, 0x00010008);              // Destination signed offset '8', Current Major Iteration Count '1' (DMA TCD register TCD0_DOFF, TCD0_CITER_ELINKNO)
                Write32(TCD_B0 + 0x038, 0xFFFB0000);              // Last destination address adjustment -NBYTES '0xFFFB0000' (DMA TCD register TCD0_DLAST_SGA)
                Write32(TCD_B0 + 0x03C, 0x00000001);              // Start DMA transfer (DMA TCD register TCD0_CSR)
              </block>
              <control while="(Read32(TCD_B0 + 0x000) &amp; 0x80000000)" timeout="1000000" info="Poll DMA is ACTIVE"/>

              <block info="Initialize DTCM via DMA">
                // DTCM: 1 x 128kB @ 0x20000000 (0x21000000 backdoor)
                Write8(0x40280000 + CHCFG0, 0x80);                // Enable DMA CH0 (DMAMUX_0 register CHCFG0)
                Write32(TCD_B0 + 0x020, 0x00400000);              // Source address '0x00400000' (DMA TCD register TCD0_SADDR)
                Write32(TCD_B0 + 0x024, 0x03030000);              // Offset '0' and attributes SSIZE, DSIZE '64bit' (DMA TCD register TCD0_SOFF, TCD0_ATTR)
                Write32(TCD_B0 + 0x028, 0x00020000);              // Transfer size Nbytes '128Kb' (DMA TCD register TCD0_NBYTES_MLOFFNO)
                Write32(TCD_B0 + 0x02C, 0x00000000);              // Last source address adjustment '0' (DMA TCD register TCD0_SLAST_SDA)
                Write32(TCD_B0 + 0x030, 0x21000000);              // Destination address '0x20000000' (DMA TCD register TCD0_DADDR)
                Write32(TCD_B0 + 0x034, 0x00010008);              // Destination signed offset '8', Current Major Iteration Count '1' (DMA TCD register TCD0_DOFF, TCD0_CITER_ELINKNO)
                Write32(TCD_B0 + 0x038, 0xFFFF0000);              // Last destination address adjustment -NBYTES '0xFFFF0000' (DMA TCD register TCD0_DLAST_SGA)
                Write32(TCD_B0 + 0x03C, 0x00000001);              // Start DMA transfer (DMA TCD register TCD0_CSR)
              </block>
              <control while="(Read32(TCD_B0 + 0x000) &amp; 0x80000000)" timeout="1000000" info="Poll DMA is ACTIVE"/>
            </sequence>
          </sequences>

