vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.S32K3xx_DFP.pdsc
          <!-- Memory adresses -->
          <memory name="PFlash" access="rx"      start="0x00400000" size="0x00400000" startup="1" default="1"/> <!-- Program Flash -->
          <memory name="DFlash" access="rx"      start="0x10000000" size="0x00020000" startup="0" default="0"/> <!-- Data Flash -->
          <memory name="SRAM_0" access="rwx"     start="0x20400000" size="0x00028000" init   ="0" default="1"/> <!-- 160 SRAM_0 Non-cacheable -->
          <memory name="SRAM_1" access="rwx"     start="0x20428000" size="0x00028000" init   ="0" default="1"/> <!-- 160 SRAM_1 Non-cacheable -->
          <memory name="DTCM_0" access="rwx"     start="0x20000000" size="0x00020000" init   ="0" default="0"/> <!-- 128 DTCM_0 Non-cacheable -->

          <!-- Flash Algorithms -->
          <algorithm name="Flash/S32K3x4_Code.FLM" start="0x00400000" size="0x00400000" RAMstart="0x20400000" RAMsize="0x00010000" default="1"/>
          <algorithm name="Flash/S32K3x4_Data.FLM" start="0x10000000" size="0x00020000" RAMstart="0x20400000" RAMsize="0x00010000" default="0"/>

          <!-- Debug access ports -->
          <debug Pname="Cortex-M7_0" __dp="0" __ap="4"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="S32K3 CMSIS">
      <description>NXP S32Kxx device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="S32K3*"/>
    </condition>

    <condition id="S32K312 CMSIS">
      <description>NXP S32K312 device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="S32K312"/>
    </condition>

    <condition id="S32K314 CMSIS">
      <description>NXP S32K314 device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="S32K314"/>
    </condition>

    <condition id="S32K324 CMSIS">
      <description>NXP S32K324 device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="S32K324"/>
    </condition>

    <condition id="S32K344 CMSIS">
      <description>NXP S32K344 device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="S32K344"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup for S32K312 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.0.0" condition="S32K312 CMSIS" isDefaultVariant="true">
      <description>System Startup for NXP S32K3 Series (C variant)</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <files>
        <!-- include folder -->
        <file category="include"      name="Device/S32K312/Include/"/>
        <!-- startup / system / linker file -->
        <file category="sourceC"      name="Device/S32K312/Source/startup_S32K312.c"          version="1.0.0" attr="config" />
        <file category="sourceC"      name="Device/S32K312/Source/system_S32K312.c"           version="1.0.0" attr="config" />
        <file category="sourceAsm"    name="Device/S32K312/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K312/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K312/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K312/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K312/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K312 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K312/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.0.0" condition="S32K312 CMSIS">
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <description>System Startup for NXP S32K3 Series (Assembler variant)</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"      name="Device/S32K312/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    name="Device/S32K312/Source/ARM/startup_S32K312.S"      version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="sourceAsm"    name="Device/S32K312/Source/GCC/startup_S32K312.S"      version="1.0.0" attr="config" condition="GCC"/>
        <file category="sourceC"      name="Device/S32K312/Source/system_S32K312.c"           version="1.0.0" attr="config"/>
        <file category="sourceAsm"    name="Device/S32K312/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K312/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K312/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K312/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K312/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K344 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K312/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>

