vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.S32K3xx_DFP.pdsc
    <!-- Startup for S32K314 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.0.0" condition="S32K314 CMSIS" isDefaultVariant="true">
      <description>System Startup for NXP S32K3 Series (C variant)</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <files>
        <!-- include folder -->
        <file category="include"      name="Device/S32K314/Include/"/>
        <!-- startup / system / linker file -->
        <file category="sourceC"      name="Device/S32K314/Source/startup_S32K314.c"          version="1.0.0" attr="config" />
        <file category="sourceC"      name="Device/S32K314/Source/system_S32K314.c"           version="1.0.0" attr="config" />
        <file category="sourceAsm"    name="Device/S32K314/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K314/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K314/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K314/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K314/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K344 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K314/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.0.0" condition="S32K314 CMSIS">
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <description>System Startup for NXP S32K3 Series (Assembler variant)</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"      name="Device/S32K314/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    name="Device/S32K314/Source/ARM/startup_S32K314.S"      version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="sourceAsm"    name="Device/S32K314/Source/GCC/startup_S32K314.S"      version="1.0.0" attr="config" condition="GCC"/>
        <file category="sourceC"      name="Device/S32K314/Source/system_S32K314.c"           version="1.0.0" attr="config"/>
        <file category="sourceAsm"    name="Device/S32K314/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K314/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K314/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K314/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K314/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K344 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K314/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>

    <!-- Startup for S32K344 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.0.0" condition="S32K324 CMSIS" isDefaultVariant="true">
      <description>System Startup for NXP S32K3 Series (C variant)</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <files>
        <!-- include folder -->
        <file category="include"      name="Device/S32K324/Include/"/>
        <!-- startup / system / linker file -->
        <file category="sourceC"      name="Device/S32K324/Source/startup_S32K324.c"          version="1.0.0" attr="config" />
        <file category="sourceC"      name="Device/S32K324/Source/system_S32K324.c"           version="1.0.0" attr="config" />
        <file category="sourceAsm"    name="Device/S32K324/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K324/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K324/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K324/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K324/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K344 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K324/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.0.0" condition="S32K324 CMSIS">
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <description>System Startup for NXP S32K3 Series (Assembler variant)</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"      name="Device/S32K324/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    name="Device/S32K324/Source/ARM/startup_S32K324.S"      version="1.0.1" attr="config" condition="ARMCC"/>
        <file category="sourceAsm"    name="Device/S32K324/Source/GCC/startup_S32K324.S"      version="1.0.1" attr="config" condition="GCC"/>
        <file category="sourceC"      name="Device/S32K324/Source/system_S32K324.c"           version="1.0.0" attr="config"/>
        <file category="sourceAsm"    name="Device/S32K324/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K324/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K324/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K324/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K324/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K344 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K324/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>

    <!-- Startup for S32K344 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.0.0" condition="S32K344 CMSIS" isDefaultVariant="true">
      <description>System Startup for NXP S32K3 Series (C variant)</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <files>
        <!-- include folder -->
        <file category="include"      name="Device/S32K344/Include/"/>
        <!-- startup / system / linker file -->
        <file category="sourceC"      name="Device/S32K344/Source/startup_S32K344.c"          version="1.0.0" attr="config" />
        <file category="sourceC"      name="Device/S32K344/Source/system_S32K344.c"           version="1.0.0" attr="config" />
        <file category="sourceAsm"    name="Device/S32K344/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K344/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K344/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K344/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K344/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K344 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K344/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.0.0" condition="S32K344 CMSIS">
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K3      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <description>System Startup for NXP S32K3 Series (Assembler variant)</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"      name="Device/S32K344/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    name="Device/S32K344/Source/ARM/startup_S32K344.S"      version="1.0.0" attr="config" condition="ARMCC"/>
        <file category="sourceAsm"    name="Device/S32K344/Source/GCC/startup_S32K344.S"      version="1.0.0" attr="config" condition="GCC"/>
        <file category="sourceC"      name="Device/S32K344/Source/system_S32K344.c"           version="1.0.0" attr="config"/>
        <file category="sourceAsm"    name="Device/S32K344/Source/startup_S32K3xx_util.S"     version="1.0.0" attr="config" />
        <file category="linkerScript" name="Device/S32K344/Source/ARM/linker/S32K3xx.sct"     version="1.0.0" attr="config" condition="ARMCC" />
        <file category="linkerScript" name="Device/S32K344/Source/GCC/linker/S32K3xx.ld"      version="1.0.0" attr="config" condition="GCC"/>
        <!-- Memory mapping -->
        <file category="header"       name="Device/S32K344/Include/S32K3xx_memmap.h"          version="1.0.0" attr="config" />

        <!-- Boot Header template -->
        <file category="sourceC"      name="Device/S32K344/Source/S32K3xx_bootheader.c"       version="1.0.0" attr="template"  select="S32K344 Boot Header"/>
        <!-- LC, XRDC config template -->
        <file category="sourceC"      name="Device/S32K344/Source/S32K3xx_lc_xrdc_config.c"   version="1.0.0" attr="template"  select="S32K344 LC XRCD Configuration"/>
      </files>
    </component>

  </components>

