vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.S32K3xx_DFP.pdsc
  <boards>
    <board name="S32K3xxCVB" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="S32K344"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="S32K3*"/>
      <description>
        The S32K3xxCVB is an Evaluation Board for the S32K3xx Device Family.
      </description>
    </board>
  </boards>

  <examples>
    <!-- Board S32K3xxCVB -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="Boards/NXP/S32K3xxCVB/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="S32K3xxCVB" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- Board S32K3xxCVB -->
    <example name="CMSIS-RTOS2 Blinky MultiCore" doc="Abstract.txt" folder="Boards/NXP/S32K3xxCVB/Blinky_MultiCore">
      <description>CMSIS-RTOS2 Blinky example for MultiCore Applications</description>
      <board name="S32K3xxCVB" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky_MultiCore.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>

</package>
